fabkury/p3a/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_IDF_SPECIFIC_ADDED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_SLAVE_IDF_TARGET_ARCH_RISCV=y
CONFIG_SLAVE_SOC_WIFI_SUPPORTED=y
CONFIG_SLAVE_SOC_WIFI_HW_TSF=y
CONFIG_SLAVE_SOC_WIFI_FTM_SUPPORT=y
CONFIG_SLAVE_SOC_WIFI_GCMP_SUPPORT=y
CONFIG_SLAVE_SOC_WIFI_HE_SUPPORT=y
CONFIG_SLAVE_SOC_WIFI_MAC_VERSION_NUM=2
CONFIG_SLAVE_FREERTOS_UNICORE=y
CONFIG_WIFI_RMT_SOFTAP_SUPPORT=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="32MB"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_80M=y
# CONFIG_SPIRAM_SPEED_20M is not set
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_BOOT_INIT=y
# Increase main task stack size for LVGL demo widgets and FATFS LFN support
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_LV_MEM_SIZE_KILOBYTES=64
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_USE_OBSERVER=y
CONFIG_LV_USE_SYSMON=y
CONFIG_LV_USE_PERF_MONITOR=y
CONFIG_LV_PERF_MONITOR_ALIGN_TOP_RIGHT=y
CONFIG_LV_USE_DEMO_WIDGETS=y
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_SPIFFS_MAX_PARTITIONS=3
CONFIG_BSP_LCD_COLOR_FORMAT_RGB888=y
# CONFIG_BSP_LCD_COLOR_FORMAT_RGB565 is not set
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=1
CONFIG_LV_COLOR_DEPTH_24=y
# CONFIG_LV_COLOR_DEPTH_16 is not set
CONFIG_LV_COLOR_DEPTH=24

# Enable frame pointer for better crash backtraces
CONFIG_ESP_SYSTEM_USE_FRAME_POINTER=y

# Enable comprehensive heap poisoning for memory corruption detection
CONFIG_HEAP_POISONING_COMPREHENSIVE=y
